Revit 2027 API
BuiltInFailures.ViewFailures.DetailNumberEmpty Property
 Detail Number is empty
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DetailNumberEmpty { get; }
Public Shared ReadOnly Property DetailNumberEmpty As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DetailNumberEmpty {
	FailureDefinitionId^ get ();
}
static member DetailNumberEmpty : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace